Revit 2027 API
Water.WaterTintEnable Property
 The property labeled "Color" from the "Water" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaterTintEnable { get; }
Public Shared ReadOnly Property WaterTintEnable As String
	Get
public:
static property String^ WaterTintEnable {
	String^ get ();
}
static member WaterTintEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaterTintEnableType".
See Also
Reference
Water Class
Autodesk.Revit.DB.Visual Namespace